Documents/ЛБ_ПеремещениеОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПеремещениеОбъектовЗалога</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОприходованныеОбъектыЗалога</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОборотыПоОперациямЗайма</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеЗалоговогоБилета</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаВСумке</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеОбъектаЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалогаВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеремещенияОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПеремещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомераПеремещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_КатегорииПоступленияОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИЗLX</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Comment>Объект залога</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОценки</Name>
							<Comment>Сумма оценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтказОтВыкупа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОприходованныеОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОприходованныеОбъектыЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_КатегорииПоступленияОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_КатегорииПоступленияОбъектовЗалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поштучно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыПеремещенияОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПеремещенияОбъектовЗалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутриПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВДругоеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторонннемуКонтрагенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_ПеремещениеОбъектовЗалога/Ext/ObjectModule.bsl
// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) тогда
	//    ЭтотОбъект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	Если НЕ ЭтотОбъект.ЗагруженИЗLX Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
			ЕстьВРеализации = Ложь;
			Для каждого Стр Из ЭтотОбъект.Товары Цикл
				СтруктураВ = ЛБ_УправлениеЛомбардом.ПроверитьОбъектЗалогаДобавленВРеализацию(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
				Если СтруктураВ = неопределено Тогда
					Продолжить;
				Иначе 
					ЕстьВРеализации = Истина;               
					ТекстСообщения = "Залог " + ПолучитьАртикулОЗ(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога) + " добавлен в реализацию" + 
					?(ЗначениеЗаполнено(СтруктураВ.Регистратор), " № " + СокрЛП(СтруктураВ.Регистратор.ПредставлениеНомера) + " от " + Формат(СтруктураВ.Регистратор.Дата, "ДЛФ="), "") + 
					", ответственный " + СтруктураВ.Ответственный;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;	 
			КонецЦикла;	 
			
			Если ЕстьВРеализации Тогда 
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьАртикулОЗ(ЗалоговыйБилет, ОбъектЗалога)
	Запрос = Новый Запрос;        
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Артикул;
	КонецЕсли;	
	Возврат "<не определен>";
КонецФункции

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;    
	Движения.ЛБ_ОбъектыЗалогаВПути.Записывать = Истина; 	
	Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
    Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина; 
	Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
	Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина; 
	Движения.ЛБ_ОприходованныеОбъектыЗалога.Записывать = Истина;  
	
	ТаблицаЗБ = ЭтотОбъект.Товары.Выгрузить(); 
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");  
	ТаблицаЗБ.Очистить();
	
	Если ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Поштучно Тогда
		ТаблицаОстатков = ЛБ_УправлениеЛомбардом.ПолучитьТоварыНаСкладеЛомбарда(Дата-1, Организация, ЭтотОбъект.ЛомбардОткуда, ЭтотОбъект.СкладОтправитель);   
		
		Для каждого Стр Из ЭтотОбъект.Товары Цикл  
			Отбор = новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиОст = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если СтрокиОст.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Изделие с артикулом " + ПолучитьАртикулОЗ(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога) + " не найдено на складе " + СокрЛП(ЭтотОбъект.СкладОтправитель));
			Иначе      
				СтрЗБ = ТаблицаЗБ.Добавить();  
				СтрЗБ.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				
				СтрОст = СтрокиОст.Получить(0);
				Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Ломбард = ЛомбардОткуда; 
				Движение.Склад = ЭтотОбъект.СкладОтправитель;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = Стр.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки; 
				//Савранин
				//Движение.СуммаОценкиНачальная = СтрОст.СуммаОценки;    
				
				Если ЭтотОбъект.ЗагруженИЗLX Тогда 
					Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Ломбард = ЛомбардКуда;   
					Движение.Склад = ЭтотОбъект.СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = Стр.Количество;
					Движение.СуммаОценки = СтрОст.СуммаОценки;  
					//Савранин
					//Движение.СуммаОценкиНачальная = СтрОст.СуммаОценки;

					
				Иначе
				
					
				Если ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения Тогда   
					Движение = Движения.ЛБ_ОбъектыЗалога.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Ломбард = ЛомбардКуда;   
					Движение.Склад = ЭтотОбъект.СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = Стр.Количество;
					Движение.СуммаОценки = СтрОст.СуммаОценки;  
					//Савранин
					//Движение.СуммаОценкиНачальная = СтрОст.СуммаОценки;

					
					Движение = Движения.ЛБ_ОприходованныеОбъектыЗалога.Добавить();
					Движение.Период = Дата;
		            Движение.Склад = СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;

					Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
					Движение.Период = Дата;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ПринятНаСклад;
					СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
					Если НЕ СтруктураСостояниеОЗ = неопределено Тогда  
						Движение.СуммаЗайма = СтруктураСостояниеОЗ.СуммаЗайма;
						Движение.СуммаОценки = СтруктураСостояниеОЗ.СуммаОценки;
						Движение.СуммаДолгаЗайма = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
						Движение.СуммаОплаты = СтруктураСостояниеОЗ.СуммаОплаты;   
						Движение.СуммаОценкиНачальная = СтруктураСостояниеОЗ.СуммаОценкиНач;
					КонецЕсли;			   
					Движение.Комментарий = "Принят " + СокрЛП(ЭтотОбъект.ЛомбардКуда) + ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель) + " из: " +
					                  СокрЛП(ЭтотОбъект.ЛомбардОткуда) + ", склад отгрузки " + СокрЛП(ЭтотОбъект.СкладОтправитель);   
									  
				Иначе
					Движение = Движения.ЛБ_ОбъектыЗалогаВПути.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Отправитель = ЛомбардОткуда; 
					Движение.СкладОтправитель = ЭтотОбъект.СкладОтправитель; 
					Движение.Получатель = ЛомбардКуда; 
					Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;
					Движение.Количество = Стр.Количество;
					Движение.СуммаОценки = СтрОст.СуммаОценки; 
					Движение.Инкассатор = ЭтотОбъект.Инкассатор;
					Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку;
					
	                Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
					Движение.Период = Дата;
					Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
					Движение.ОбъектЗалога = Стр.ОбъектЗалога;  
			        СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет);
					Движение.СтатусОбъектаЗалога = ?(СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ, Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПутиОХ, Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПути);
					СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
					Если НЕ СтруктураСостояниеОЗ = неопределено Тогда  
						Движение.СуммаЗайма = СтруктураСостояниеОЗ.СуммаЗайма;
						Движение.СуммаОценки = СтруктураСостояниеОЗ.СуммаОценки;
						Движение.СуммаДолгаЗайма = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
						Движение.СуммаОплаты = СтруктураСостояниеОЗ.СуммаОплаты;  
						Движение.СуммаОценкиНачальная = СтруктураСостояниеОЗ.СуммаОценкиНач;
					КонецЕсли;			
					Движение.Комментарий = "Отправитель: " + СокрЛП(ЭтотОбъект.ЛомбардОткуда) + ", склад отгрузки " + СокрЛП(ЭтотОбъект.СкладОтправитель) + ", Получатель " +
					                  СокрЛП(ЭтотОбъект.ЛомбардКуда) + ?(ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту, "", ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель));
									  
				КонецЕсли; 
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;	     
	
	ИначеЕсли ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка Тогда 
		Движения.ЛБ_ОбъектыЗалогаВСумке.Записывать = Истина;
		
		ТаблицаОстатковВСумке = ЛБ_УправлениеЛомбардом.ПолучитьТоварыВСумке(Дата-1, Организация, ЭтотОбъект.ЛомбардОткуда, ЭтотОбъект.СкладОтправитель, ЭтотОбъект.НакладнаяНаОтгрузку);     
		Для каждого Стр Из ЭтотОбъект.Товары Цикл  
			Отбор = новый структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
			СтрокиОст = ТаблицаОстатковВСумке.НайтиСтроки(Отбор);
			Если СтрокиОст.Количество() = 0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("Изделие с артикулом " + ПолучитьАртикулОЗ(Стр.ЗалоговыйБилет, Стр.ОбъектЗалога) + " не найдено в сумке на складе " + СокрЛП(ЭтотОбъект.СкладОтправитель));
			Иначе 
				СтрЗБ = ТаблицаЗБ.Добавить();  
				СтрЗБ.ЗалоговыйБилет = Стр.ЗалоговыйБилет;

				СтрОст = СтрокиОст.Получить(0);
				Движение = Движения.ЛБ_ОбъектыЗалогаВСумке.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Отправитель = СтрОст.Отправитель; 
				Движение.СкладОтправитель = СтрОст.СкладОтправитель; 
				Движение.Получатель = СтрОст.Получатель; 
				Движение.СкладПолучатель = СтрОст.СкладПолучатель;
				Движение.ЗалоговыйБилет = СтрОст.ЗалоговыйБилет;
				Движение.ОбъектЗалога = СтрОст.ОбъектЗалога;
				Движение.Количество = СтрОст.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки; 
				Движение.Инкассатор = СтрОст.Инкассатор;
                Движение.НакладнаяНаОтгрузку = СтрОст.НакладнаяНаОтгрузку; 
								
				Движение = Движения.ЛБ_ОбъектыЗалогаВПути.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Отправитель = ЛомбардОткуда; 
				Движение.СкладОтправитель = ЭтотОбъект.СкладОтправитель; 
				Движение.Получатель = ЛомбардКуда; 
				Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.Количество = Стр.Количество;
				Движение.СуммаОценки = СтрОст.СуммаОценки; 
				Движение.Инкассатор = ЭтотОбъект.Инкассатор;
				Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку;
				
                Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
				Движение.Период = Дата;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Движение.ОбъектЗалога = Стр.ОбъектЗалога;
				Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВПути;
				СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
				Если НЕ СтруктураСостояниеОЗ = неопределено Тогда  
					Движение.СуммаЗайма = СтруктураСостояниеОЗ.СуммаЗайма;
					Движение.СуммаОценки = СтруктураСостояниеОЗ.СуммаОценки;
					Движение.СуммаДолгаЗайма = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
					Движение.СуммаОплаты = СтруктураСостояниеОЗ.СуммаОплаты;  
					Движение.СуммаОценкиНачальная = СтруктураСостояниеОЗ.СуммаОценкиНач;
				КонецЕсли;			
				Движение.Комментарий = "Отправитель: " + СокрЛП(ЭтотОбъект.ЛомбардОткуда) + ", склад отгрузки " + СокрЛП(ЭтотОбъект.СкладОтправитель) + ", Получатель " +
				                  СокрЛП(ЭтотОбъект.ЛомбардКуда) + ?(ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.СторонннемуКонтрагенту, "", ", склад-получатель " + СокрЛП(ЭтотОбъект.СкладПолучатель));	
								  
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
	//ТаблицаЗБ = ЭтотОбъект.Товары.Выгрузить(); 
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет");  
	
	Для каждого Стр Из ТаблицаЗБ Цикл
	    Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
		Движение.Период = Дата; 
		Движение.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель;
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
		Движение.Организация = ЭтотОбъект.Организация;  
		Движение.Ломбард = ЭтотОбъект.ЛомбардОткуда;
		Если ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка Тогда	
		    Движение.ВидОперации = "Перемещение объектов залога (сумка)"; 
		Иначе 
			Движение.ВидОперации = "Перемещение объектов залога";
			
			Если НЕ ЭтотОбъект.ВидОперации = Перечисления.ЛБ_ВидыПеремещенияОбъектовЗалога.ВнутриПодразделения Тогда
				СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет);
				Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ГотовКОтправкеОХ Тогда
					СостояниеЗБ = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗалоговогоБилета(ЭтотОбъект, Стр.ЗалоговыйБилет);				  
					Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
				    Движение.Период = Дата;
			        Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
					Движение.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель;
					Движение.НомерЗалоговогоБилета = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета; 
					Движение.СхемаКредитования = Стр.ЗалоговыйБилет.СхемаКредитования;
		            Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ВПутиОХ; 
					Если НЕ СостояниеЗБ = неопределено Тогда
						Движение.СуммаЗайма = СостояниеЗБ.СуммаЗайма; 
						Движение.ДатаНачалаРасчетаПроцентов = СостояниеЗБ.ДатаНачалаРасчета;
						Движение.ДатаВыкупа = СостояниеЗБ.ДатаВыкупа;
						Движение.ДатаВыкупаЛьготныйСрок = СостояниеЗБ.ДатаВыкупаЛьготныйСрок;
						Движение.ПричинаПрименения = СостояниеЗБ.ПричинаПрименения;
						Движение.НомерДопСоглашения = СостояниеЗБ.НомерДопСоглашения; 
					КонецЕсли;	
				КонецЕсли;	 
			КонецЕсли;	
		КонецЕсли;	
    КонецЦикла;
	
	Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;  
	Движение.ПодразделениеОсновное = ЭтотОбъект.ЛомбардОткуда;
	Движение.СкладОсновной = ЭтотОбъект.СкладОтправитель;
	Движение.ПодразделениеОтправитель = ЭтотОбъект.ЛомбардОткуда;
	Движение.СкладОтправитель = ЭтотОбъект.СкладОтправитель;   
	Движение.ПодразделениеПолучатель = ЭтотОбъект.ЛомбардКуда;
	Движение.СкладПолучатель = ЭтотОбъект.СкладПолучатель;
	Движение.Количество = Товары.Итог("Количество");
	Движение.Ответственный = ЭтотОбъект.Ответственный; 
	Движение.Инкассатор = ЭтотОбъект.Инкассатор; 
	Движение.НакладнаяНаОтгрузку = ЭтотОбъект.НакладнаяНаОтгрузку;
	Движение.ВидОперации = "Перемещение" + ?(ЭтотОбъект.Категория = Перечисления.ЛБ_КатегорииПоступленияОбъектовЗалога.Сумка, " (сумка)", "");

КонецПроцедуры    

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
				
	ЗапросП = Новый Запрос;
	ЗапросП.УстановитьПараметр("Дата", ЭтотОбъект.Дата); 
	ЗапросП.УстановитьПараметр("ОбъектыЗалога", ЭтотОбъект.Товары.ВыгрузитьКолонку("ОбъектЗалога"));
	ЗапросП.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЛБ_ОбъектыЗалога.Регистратор КАК Регистратор
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалога КАК ЛБ_ОбъектыЗалога
	                |ГДЕ
	                |	ЛБ_ОбъектыЗалога.ОбъектЗалога В(&ОбъектыЗалога)
	                |	И ЛБ_ОбъектыЗалога.Период > &Дата
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЛБ_ОбъектыЗалогаВПути.Регистратор
	                |ИЗ
	                |	РегистрНакопления.ЛБ_ОбъектыЗалогаВПути КАК ЛБ_ОбъектыЗалогаВПути
	                |ГДЕ
	                |	ЛБ_ОбъектыЗалогаВПути.Период > &Дата
	                |	И ЛБ_ОбъектыЗалогаВПути.ОбъектЗалога В(&ОбъектыЗалога)";
	ВыборкаП = ЗапросП.Выполнить().Выбрать();
	Если ВыборкаП.Следующий() тогда 
		Сообщить("Есть более поздние операции по движению объектов залога из документа. Снятие документа с проведения запрещено.");  
		Отказ = Истина;
		Возврат;
	КонецЕсли;                                        
		
КонецПроцедуры // ОбработкаУдаленияПроведения()
